mmmh, I haven't applied this yet, but I found these new changes from master.
```
15:24:09.618 STDOUT terraform:   + create
15:24:09.618 STDOUT terraform: Terraform will perform the following actions:
15:24:09.618 STDOUT terraform:   # module.ubuntu_22_2c.aws_codebuild_webhook.ubuntu_project_webhook will be created
15:24:09.618 STDOUT terraform:   + resource "aws_codebuild_webhook" "ubuntu_project_webhook" {
15:24:09.618 STDOUT terraform:       + build_type   = "BUILD"
15:24:09.618 STDOUT terraform:       + id           = (known after apply)
15:24:09.618 STDOUT terraform:       + payload_url  = (known after apply)
15:24:09.618 STDOUT terraform:       + project_name = "ubuntu-22-2c"
15:24:09.618 STDOUT terraform:       + secret       = (sensitive value)
15:24:09.618 STDOUT terraform:       + url          = (known after apply)
15:24:09.618 STDOUT terraform:       + filter_group {
15:24:09.618 STDOUT terraform:           + filter {
15:24:09.618 STDOUT terraform:               + exclude_matched_pattern = false
15:24:09.618 STDOUT terraform:               + pattern                 = "WORKFLOW_JOB_QUEUED"
15:24:09.618 STDOUT terraform:               + type                    = "EVENT"
15:24:09.618 STDOUT terraform:             }
15:24:09.618 STDOUT terraform:         }
15:24:09.618 STDOUT terraform:     }
15:24:09.618 STDOUT terraform:   # module.ubuntu_22_36c.aws_codebuild_webhook.ubuntu_project_webhook will be created
15:24:09.618 STDOUT terraform:   + resource "aws_codebuild_webhook" "ubuntu_project_webhook" {
15:24:09.618 STDOUT terraform:       + build_type   = "BUILD"
15:24:09.618 STDOUT terraform:       + id           = (known after apply)
15:24:09.619 STDOUT terraform:       + payload_url  = (known after apply)
15:24:09.619 STDOUT terraform:       + project_name = "ubuntu-22-36c"
15:24:09.619 STDOUT terraform:       + secret       = (sensitive value)
15:24:09.619 STDOUT terraform:       + url          = (known after apply)
15:24:09.619 STDOUT terraform:       + filter_group {
15:24:09.619 STDOUT terraform:           + filter {
15:24:09.619 STDOUT terraform:               + exclude_matched_pattern = false
15:24:09.619 STDOUT terraform:               + pattern                 = "WORKFLOW_JOB_QUEUED"
15:24:09.619 STDOUT terraform:               + type                    = "EVENT"
15:24:09.619 STDOUT terraform:             }
15:24:09.619 STDOUT terraform:         }
15:24:09.619 STDOUT terraform:     }
15:24:09.619 STDOUT terraform:   # module.ubuntu_22_4c.aws_codebuild_webhook.ubuntu_project_webhook will be created
15:24:09.619 STDOUT terraform:   + resource "aws_codebuild_webhook" "ubuntu_project_webhook" {
15:24:09.619 STDOUT terraform:       + build_type   = "BUILD"
15:24:09.619 STDOUT terraform:       + id           = (known after apply)
15:24:09.619 STDOUT terraform:       + payload_url  = (known after apply)
15:24:09.619 STDOUT terraform:       + project_name = "ubuntu-22-4c"
15:24:09.619 STDOUT terraform:       + secret       = (sensitive value)
15:24:09.619 STDOUT terraform:       + url          = (known after apply)
15:24:09.619 STDOUT terraform:       + filter_group {
15:24:09.619 STDOUT terraform:           + filter {
15:24:09.619 STDOUT terraform:               + exclude_matched_pattern = false
15:24:09.619 STDOUT terraform:               + pattern                 = "WORKFLOW_JOB_QUEUED"
15:24:09.619 STDOUT terraform:               + type                    = "EVENT"
15:24:09.619 STDOUT terraform:             }
15:24:09.619 STDOUT terraform:         }
15:24:09.619 STDOUT terraform:     }
15:24:09.619 STDOUT terraform:   # module.ubuntu_22_8c.aws_codebuild_webhook.ubuntu_project_webhook will be created
15:24:09.620 STDOUT terraform:   + resource "aws_codebuild_webhook" "ubuntu_project_webhook" {
15:24:09.620 STDOUT terraform:       + build_type   = "BUILD"
15:24:09.620 STDOUT terraform:       + id           = (known after apply)
15:24:09.620 STDOUT terraform:       + payload_url  = (known after apply)
15:24:09.620 STDOUT terraform:       + project_name = "ubuntu-22-8c"
15:24:09.620 STDOUT terraform:       + secret       = (sensitive value)
15:24:09.620 STDOUT terraform:       + url          = (known after apply)
15:24:09.620 STDOUT terraform:       + filter_group {
15:24:09.620 STDOUT terraform:           + filter {
15:24:09.620 STDOUT terraform:               + exclude_matched_pattern = false
15:24:09.620 STDOUT terraform:               + pattern                 = "WORKFLOW_JOB_QUEUED"
15:24:09.620 STDOUT terraform:               + type                    = "EVENT"
15:24:09.620 STDOUT terraform:             }
15:24:09.620 STDOUT terraform:         }
15:24:09.620 STDOUT terraform:     }
15:24:09.620 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
```

I'm applying them and see if the job start without this change.